Revit 2027 API
DirectShape.AppendShape(IList<GeometryObject>) Method
 Appends the collection of GeometryObjects into the model shape representation stored in this DirectShape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AppendShape(
	IList<GeometryObject> pGeomArr
)
Public Sub AppendShape (
	pGeomArr As IList(Of GeometryObject)
)
public:
void AppendShape(
	IList<GeometryObject^>^ pGeomArr
)
member AppendShape :
        pGeomArr : IList<GeometryObject> -> unit
Parameters
pGeomArr IList<GeometryObject>
 Shape expressed as a collection of GeometryObjects. The supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point and Curve.
Exceptions
Exception | Condition
ArgumentException |  At least one member of pGeomArr does not satisfy DirectShape validation criteria.
ArgumentNullException |  A non-optional argument was null
Remarks
 The existing shape will not be cleared by this function, and intersecting or overlapped geometry will not be joined with the appended geometry. It is up to the caller to ensure that the combination of geometry will have the correct appearance in Revit.
See Also
Reference
DirectShape Class
AppendShape Overload
Autodesk.Revit.DB Namespace